; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-4-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	p1-0 - location
	p1-2 - location
	p2-0 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s1)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at package1 s1)
	(at package2 s2)
	(at package3 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 13)
	(= (time-to-walk p1-0 s1) 13)
	(= (time-to-walk s0 p1-0) 80)
	(= (time-to-walk p1-0 s0) 80)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 18)
	(= (time-to-walk p1-2 s1) 18)
	(= (time-to-walk s2 p1-2) 23)
	(= (time-to-walk p1-2 s2) 23)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 42)
	(= (time-to-walk p2-0 s2) 42)
	(= (time-to-walk s0 p2-0) 23)
	(= (time-to-walk p2-0 s0) 23)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 60)
	(= (time-to-drive s0 s1) 60)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 84)
	(= (time-to-drive s0 s2) 84)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 10)
	(= (time-to-drive s1 s2) 10)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver3 s0)
	(at truck4 s1)
	(at package1 s2)
	(at package2 s2)
	(at package3 s0)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 4  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver1 truck4 s1)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 2 of 6
2. (walk driver3 s1 p1-0)
   deleted: (at driver3 s1)
   added: (at driver3 p1-0)
   changed: (walked) from 0 to 13
   goals met: 2 of 6
3. (drive-truck truck4 s1 s2 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   changed: (driven) from 0 to 10
   goals met: 1 of 6
4. (load-truck package3 truck4 s2)
   deleted: (at package3 s2)
   added: (in package3 truck4)
   goals met: 1 of 6
5. (drive-truck truck4 s2 s0 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (driven) from 10 to 94
   goals met: 1 of 6
6. (unload-truck package3 truck4 s0)
   deleted: (in package3 truck4)
   added: (at package3 s0)
   goals met: 2 of 6
7. (drive-truck truck4 s0 s2 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (driven) from 94 to 178
   goals met: 2 of 6
8. (disembark-truck driver1 truck4 s2)
   deleted: (driving driver1 truck4)
   added: (at driver1 s2) (empty truck4)
   goals met: 3 of 6
9. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 2 of 6
10. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 178 to 188
   goals met: 2 of 6
11. (load-truck package1 truck3 s1)
   deleted: (at package1 s1)
   added: (in package1 truck3)
   goals met: 2 of 6
12. (walk driver4 s1 p1-2)
   deleted: (at driver4 s1)
   added: (at driver4 p1-2)
   changed: (walked) from 13 to 31
   goals met: 2 of 6
13. (drive-truck truck3 s1 s2 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 188 to 198
   goals met: 2 of 6
14. (unload-truck package1 truck3 s2)
   deleted: (in package1 truck3)
   added: (at package1 s2)
   goals met: 3 of 6
15. (walk driver3 p1-0 s0)
   deleted: (at driver3 p1-0)
   added: (at driver3 s0)
   changed: (walked) from 31 to 111
   goals met: 4 of 6
16. (walk driver4 p1-2 s2)
   deleted: (at driver4 p1-2)
   added: (at driver4 s2)
   changed: (walked) from 111 to 134
   goals met: 4 of 6
17. (board-truck driver4 truck4 s2)
   deleted: (at driver4 s2) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 4 of 6
18. (drive-truck truck4 s2 s1 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (driven) from 198 to 208
   goals met: 5 of 6
19. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 6 of 6
